cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'heroku/brew'

# brew 'act' # GitHub Actions locally
brew 'asdf'
brew 'awscli'
brew 'bat'
brew 'esptool'
brew 'eza'
brew 'docker'
brew 'git-secrets'
brew 'heroku'
brew 'htop'
brew 'imagemagick'
brew 'jhead'
brew 'minio'
# brew 'n' # -> use asdf
# brew 'node'
brew 'oci-cli'
brew 'puma/puma/puma-dev'
brew 'rbenv'
brew 'shpotify'
brew 'spaceman-diff'
brew 'spicetify'
brew 'vim'
brew 'wget'
brew 'yt-dlp'
brew 'z'

##### ToDo
# disk-graph
# davinci resolve -> Not possible

cask '1password'
cask '1password-cli'
cask 'alfred' # Alfred Settings are stored in Synology Drive -> Documents/Alfred Settings
cask 'ao' # Microsoft To-Do
cask 'anydesk'
cask 'betterdisplay'
cask 'bettermouse' # https://better-mouse.com/
cask 'brave-browser'
cask 'chatall'
cask 'cheatsheet'
cask 'cleanmymac'
cask 'colorpicker-materialdesign'
cask 'cyberduck'
cask 'diffmerge'
cask 'displaylink'
cask 'docker'
cask 'domzilla-caffeine'
cask 'dropbox'
cask 'ears'
cask 'evernote'
cask 'exifrenamer'
cask 'filemon'
cask 'firefox'
# cask 'flux' # Screen color temperatur controller
cask 'fmail'
cask 'franz'
cask 'fujitsu-scansnap-home'
cask 'github'
cask 'gpg-suite-no-mail'
cask 'hiddenbar'
cask 'istat-menus'
cask 'iterm2'
cask 'logi-options+'
cask 'maczip'
cask 'mas'
cask 'microsoft-auto-update'
cask 'microsoft-excel'
cask 'microsoft-outlook'
cask 'microsoft-teams'
cask 'microsoft-word'
cask 'mqtt-explorer'
cask 'opera'
cask 'osxfuse'
cask 'path-finder'
cask 'postgres-unofficial'
cask 'postico'
cask 'postman'
cask 'rectangle'
cask 'sequel-ace'
cask 'signal'
cask 'sonos'
cask 'spotify'
cask 'synology-drive'
cask 'synology-note-station-client'
cask 'telegram'
cask 'tower'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'wifiman'
cask 'zoom'
