cask_args appdir: '/Applications'

tap 'buo/cask-upgrade'
tap 'github/gh'
tap 'heroku/brew'
tap 'homebrew/bundle'
tap 'null-dev/firefox-profile-switcher'

# brew 'act' # GitHub Actions locally
brew 'awscli'
brew 'bat'
brew 'clamav'
brew 'coreutils'
# brew 'docker' # Docker cask is enough!!!
brew 'esptool'
brew 'eza'
brew 'gh'
brew 'git-secrets'
brew 'heroku'
brew 'hugo'
brew 'htop'
brew 'imagemagick'
brew 'jhead'
brew 'jq'
brew 'mas'
brew 'minio'
brew 'mise'
# brew 'n' # -> use mise
# brew 'node' # -> use mise
brew 'null-dev/firefox-profile-switcher/firefox-profile-switcher-connector'
brew 'oci-cli'
brew 'php'
brew 'postgresql' # needed for ruby pg gem install
brew 'puma/puma/puma-dev'
# brew 'rbenv' # -> use mise
brew 'shpotify'
brew 'spaceman-diff'
brew 'spicetify-cli'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'yt-dlp'
brew 'z'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

cask '1password'
cask '1password-cli'
cask 'alfred' # Alfred Settings are stored in Synology Drive -> Documents/MacSettings/AlfredApp
cask 'ao' # Microsoft To-Do
cask 'anydesk'
cask 'betterdisplay'
cask 'brave-browser'
cask 'cakebrew'
cask 'chatall'
cask 'cheatsheet'
cask 'cisdem-duplicate-finder'
cask 'cleanmymac'
cask 'colorpicker-materialdesign'
cask 'cyberduck'
cask 'diffmerge'
cask 'displaylink'
cask 'docker'
cask 'domzilla-caffeine'
cask 'dropbox'
cask 'ears'
cask 'evernote'
cask 'exifrenamer'
cask 'filemon'
cask 'firefox'
cask 'flux' # Screen color temperatur controller
cask 'fmail2'
cask 'font-meslo-lg-nerd-font'
# cask 'franz' # Using whatsapp cask directly
cask 'fujitsu-scansnap-home'
cask 'github'
cask 'gpg-suite-no-mail'
cask 'hiddenbar'
cask 'istat-menus'
cask 'iterm2'
cask 'logi-options+'
cask 'logitune'
cask 'macmediakeyforwarder' # Music button on keyboard handling
cask 'maczip'
cask 'microsoft-auto-update'
cask 'microsoft-excel'
cask 'microsoft-outlook'
cask 'microsoft-teams'
cask 'microsoft-word'
cask 'mongodb-compass'
cask 'mqtt-explorer'
cask 'opera'
# cask 'osxfuse' # Does not work with macOS >= 14
cask 'path-finder'
cask 'postgres-unofficial'
cask 'postico'
cask 'postman'
cask 'rapidapi'
cask 'rectangle'
cask 'sequel-ace'
cask 'signal'
cask 'sonos'
cask 'spotify'
cask 'synology-drive'
cask 'synology-note-station-client'
cask 'telegram'
cask 'tower'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'wifiman'
cask 'zoom'

mas '1password for safari', id: 1569813296
mas 'Awesome Screenshot & Recorder', id: 1531282066
mas 'Disk Graph', id: 697942581
mas 'iA Writer Classic', id: 439623248
mas 'Mela – Recipe Manager', id: 1568924476
mas 'MQTT Explorer', id: 1455214828
mas 'Refined GitHub', id: 1519867270
